---
type: ExportLinetypeTable
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# ExportLinetypeTable

`Autodesk.Revit.DB.ExportLinetypeTable` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLinetypeTable | — | `public ExportLinetypeTable ()` |
| Method | Add | — | `public void Add ( ExportLinetypeKey exportLinetypeKey , ExportLinetypeInfo exportLinetypeInfo )` |
| Method | Clear | — | `public void Clear ()` |
| Method | ContainsKey | — | `public bool ContainsKey ( ExportLinetypeKey exportLinetypeKey )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < KeyValuePair < ExportLinetypeKey , ExportLinetypeInfo >> GetEnumerator ()` |
| Method | GetExportLinetypeInfo | — | `public ExportLinetypeInfo GetExportLinetypeInfo ( ExportLinetypeKey exportLinetypeKey )` |
| Method | GetKeys | — | `public IList < ExportLinetypeKey > GetKeys ()` |
| Method | GetLinetypeTableIterator | — | `public ExportLinetypeTableIterator GetLinetypeTableIterator ()` |
| Method | GetValues | — | `public IList < ExportLinetypeInfo > GetValues ()` |
| Method | Remove | — | `public void Remove ( ExportLinetypeKey exportLinetypeKey )` |
| Property | Count | — | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Item | 2014 | `public ExportLinetypeInfo this [ ExportLinetypeKey linetypeKey ] { get ; set ; }` |